Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Having register_globals off affects the set of predefined variables available in the global scope.
pt_br: Tendo register_globals off Tendo register_globals off afeta o conjunto de variáveis predefinidas disponíveis no escopo global.

source: For example, to get DOCUMENT_ROOT you' ll use $_SERVER['DOCUMENT_ROOT'] instead of $DOCUMENT_ROOT, or $_GET['id'] from the URL http: / /www.example.com / test.php?id=3 instead of $id, or $_ENV['HOME'] instead of $HOME.
pt_br: POr exemplo, para ler DOCUMENT_ROOT você usará $_SERVER[ 'DOCUMENT_ROOT'] em vez de $DOCUMENT_ROOT, ou $_GET['id'] da URL http: / /www.example.com / test.php?id=3 em vez de $id, or $_ENV['HOME'] em vez de $HOME.

source: For related information on this change, read the configuration entry for register_globals, the security chapter on Using Register Globals, as well as the PHP 4.1.0 and 4.2.0 Release Announcements.
pt_br: Para informações relacionadas desta modificação, veja detalhes da diretiva register_globals, no capítulo de segurança em Usando register_globals, assim como o detalhamento de lançamento das versões do PHP 4.1.0 e 4.2.0.

source: Using the available PHP Reserved Predefined Variables, like the superglobal arrays, is preferred.
pt_br: Utilizar as Variáveis Predefinidas do PHP, como os arrays superglobais, é muito mais preferível.

source: From version 4.1.0 onward, PHP provides an additional set of predefined arrays containing variables from the web server (if applicable), the environment, and user input.
pt_br: Desde a versão 4.1.0, o PHP fornece um conjunto adicional de arrays predefinidos contendo as variáveis do servidor web (se aplicável), as variáveis ambiente e as entradas do usuário.

source: These new arrays are rather special in that they are automatically global--i.e., automatically available in every scope.
pt_br: Esses novos arrays são especiais pelo motivo que são automaticamente globais (significa que são automaticamente disponíveis em qualquer escopo.

source: Also, you' ll notice how the older predefined variables ($HTTP_*_VARS) still exist.
pt_br: Entretanto, para uma explicação de seu conteúdo e detalhes sobre as variáveis predefinidas do PHP e sua natureza, veja a seção Variáveis Predefinidas.

source: Superglobals cannot be used as variable variables.
pt_br: Veja também que todas as outras variáveis predefinidas antigas ($HTTP_*_VARS) ainda existem.

source: If certain variables in variables_order are not set, their appropriate PHP predefined arrays are also left empty.
pt_br: Se todos os indicadores não estiverem configurados no variables_order, seus arrays superglobais predefinidos respectivos estarão vazios.

source: PHP Superglobals
pt_br: Superglobais do PHP

source: Contains a reference to every variable which is currently available within the global scope of the script.
pt_br: Contém um referência para todas as variáveis que são atualmente disponíveis dentro do escopo global do script.

source: The keys of this array are the names of the global variables. $GLOBALS has existed since PHP 3.
pt_br: As chaves desse array são os nomes das variáveis globais. $GLOBALS existe desde o PHP 3.

source: Variables set by the web server or otherwise directly related to the execution environment of the current script.
pt_br: Variáveis criadas pelo servidor web ou diretamente relacionadas ao ambiente de execução do script atual.

source: Analogous to the old $HTTP_SERVER_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_SERVER_VARS (que ainda continua disponível, mas em decadência).

source: Variables provided to the script via HTTP GET.
pt_br: Variáveis postadas para o script via método HTTP GET.

source: Analogous to the old $HTTP_GET_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_GET_VARS (que ainda continua disponível, mas em decadência).

source: Variables provided to the script via HTTP POST.
pt_br: Variáveis postadas para o script via método HTTP POST.

source: Analogous to the old $HTTP_POST_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_POST_VARS (que ainda continua disponível, mas em decadência).

source: Variables provided to the script via HTTP cookies.
pt_br: Variáveis postadas para o script via cookies HTTP.

source: Analogous to the old $HTTP_COOKIE_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_COOKIE_VARS (que ainda continua disponível, mas em decadência).

source: Variables provided to the script via HTTP post file uploads.
pt_br: Variáveis postadas para o script via transferência de arquivos HTTP.

source: Analogous to the old $HTTP_POST_FILES array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_POST_FILES (que ainda continua disponível, mas em decadência).

source: See POST method uploads for more information.
pt_br: Veja uploads via método POST para maiores informações.

source: Variables provided to the script via the environment.
pt_br: Variáveis disponíveis no script do ambiente de execução.

source: Analogous to the old $HTTP_ENV_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_ENV_VARS (que ainda continua disponível, mas em decadência).

source: Variables provided to the script via any user input mechanism, and which therefore cannot be trusted.
pt_br: Variáveis postadas para o script por todas os mecanismos de input, e que não podem ter seu conteúdo garantido de qualquer forma.

source: The presence and order of variable inclusion in this array is defined according to the variables_order configuration directive.
pt_br: A presença e a ordem de inclusão das variáveis nesse array é definida de acordo com a diretiva de configuração variables_order.

source: This array has no direct analogue in versions of PHP prior to 4.1.0.
pt_br: Este array não tem um equivalente nas versões anteriores do PHP 4.1.0.

source: See also import_request_variables().
pt_br: Veja também import_request_variables().

source: When running on the command line, this will not include the argv and argc entries; these are present in the $_SERVER array.
pt_br: Quando executando na linha de comando, isto não inclui as entradas argv e argc; elas estão presentes no array $_SERVER.

source: Variables which are currently registered to a script 's session.
pt_br: Variáveis que estão atualmente registradas na sessão do script.

source: Analogous to the old $HTTP_SESSION_VARS array (which is still available, but deprecated).
pt_br: Análogo ao antigo array $HTTP_SESSION_VARS (que ainda continua disponível, mas em decadência).

source: See the Session handling functions section for more information.
pt_br: Veja a sessão funções de manipulação de Sessões para maiores informações.

source: Variable scope
pt_br: Escopo de variáveis

source: The scope of a variable is the context within which it is defined.
pt_br: O escopo de uma variável é o contexto onde ela foi definida.

source: For the most part all PHP variables only have a single scope.
pt_br: A maior parte das variáveis do PHP tem somente escopo local.

source: This single scope spans included and required files as well.
pt_br: Este escopo local inclui os arquivos incluídos.

source: Here the $a variable will be available within the included b.inc Here the $a variable will be available within the included b.inc script.
pt_br: Aqui a variável $a estará disponível no script incluído b.inc.

source: However, within user-defined functions a local function scope is introduced.
pt_br: Entretanto, com as funções definidas pelo usuário, um escopo local é introduzido.

source: Any variable used inside a function is by default limited to the local function scope.
pt_br: Quaisquer variáveis utilizadas dento da função é por default limitada dentro do escopo local da função.

source: ?php $a = 1; / * global scope * / function Test() {echo $a; / * reference to local scope variable * /} Test();?
pt_br: ?php $a = 1; / * escopo global * / function Teste() {echo $a; / * referencia uma variável do escopo local (não definida) * /} Test();?

source: This script will not produce any output because the echo statement refers to a local version of the $a variable, and it has not been assigned a value within this scope.
pt_br: Este script não produz nenhuma saída porque a instrução echo() refere-se a uma versão local da variável $a, e ela não tem nenhum valor assimilado nesse escopo.

source: You may notice that this is a little bit different from the C language in that global variables in C are automatically available to functions unless specifically overridden by a local definition.
pt_br: Essa é uma pequena diferença da linguagem C quando variáveis globais são automaticamente disponíveis para funções sem sobreescrever uma eventual definição local.

source: This can cause some problems in that people may inadvertently change a global variable.
pt_br: Isto causa problemas quando as pessoas mudam inadivertidamente uma variável global.

source: In PHP global variables must be declared global inside a function if they are going to be used in that function.
pt_br: No PHP, as variáveis globais precisam ser declaradas globais dentro de uma função se ela vai ser utilizada naquela função.

source: ?php $a = 1; $b = 2; function Sum() {global $a, $b; $b = $a + $b;} Sum(); echo $b;?
pt_br: ?php $a = 1; $b = 2; function Soma() {global $a, $b; $b = $a + $b;} Soma(); echo $b;?

source: The above script will output "3".
pt_br: O script acima imprimirá "3".

source: By declaring $a and $b By declaring $a and $b global within the function, all references to either variable will refer to the global version.
pt_br: Declarando $a e $b globais na função, todas as referências a essas variáveis referem-se a versão global.

source: There is no limit to the number of global variables that can be manipulated by a function.
pt_br: Não há um limite para o número de variáveis globais que podem ser manipuladas por uma função.

source: A second way to access variables from the global scope is to use the special PHP-defined $GLOBALS array.
pt_br: Uma segunda maneira de acessar variáveis do escopo global é utilizando o array especial $GLOBALS definido pelo PHP.

source: The previous example can be rewritten as:
pt_br: O exemplo anterior poderia ser rescrito como:

source: ?php $a = 1; $b = 2; function Sum() {$GLOBALS["b"] = $GLOBALS["a"] + $GLOBALS["b"];} Sum(); echo $b;?
pt_br: ?php $a = 1; $b = 2; function Soma() {$GLOBALS["b"] = $GLOBALS["a"] + $GLOBALS["b"];} Soma(); echo $b;?

source: The $GLOBALS array is an associative array with the name of the global variable being the key and the contents of that variable being the value of the array element.
pt_br: O array $GLOBALS é um array associativo onde o nome da variável global é a chave do array e o seu conteúdo da variável como o valor do elemento do array.

source: Notice how $GLOBALS exists in any scope, this is because $GLOBALS is a superglobal.
pt_br: Veja que $GLOBALS existe em qualquer escopo, isto porque $GLOBALS é uma superglobal.

source: Here 's an example demonstrating the power of superglobals:
pt_br: Segue um exemplo demonstrando o poder das superglobais:

source: ?php function test_global() {/ / Most predefined variables aren't "super "and require / / 'global 'to be available to the functions local scope. global $HTTP_POST_VARS; print $HTTP_POST_VARS['name']; / / Superglobals are available in any scope and do / / not require'global'.
pt_br: ?php function test_global() {/ / A maioria das variaveis predefinidas nao sao 'super 'e requerem / / 'global' para serem disponiveis para funcoes em qualquer escopo. global $HTTP_POST_VARS; print $HTTP_POST_VARS['name']; / / Superglobais são disponiveis em qualquer escopo e / / nao precisam de 'global '.

source: Superglobals are available / / as of PHP 4.1.0 print $_POST[ 'name'];}?
pt_br: Superglobais existem / / desde o PHP 4.1.0 print $_POST[ 'name'];}?

source: Another important feature of variable scoping is the static Another important feature of variable scoping is the static variable.
pt_br: Outro recurso importante do escopo de variáveis é a variável estática.

source: A static variable exists only in a local function scope, but it does not lose its value when program execution leaves this scope.
pt_br: Uma variável estática existe somente no escopo local da função, mas ela não perde seu valor quando o nível de execução do programa deixa o escopo.

source: Consider the following example:
pt_br: Considere o seguinte exemplo:

source: ?php function Test () {$a = 0; echo $a; $a++;}?
pt_br: ?php function Teste () {$a = 0; echo $a; $a++;}?

source: This function is quite useless since every time it is called it sets $a to 0 and prints "0".
pt_br: Essa função é inútil partindo de que cada vez que ela é chamada, ela coloca em $a o valor 0 e imprime "0".

source: The $a + + which increments the variable serves no purpose since as soon as the function exits the $a variable disappears.
pt_br: A instrução $a + +, que aumenta o valor da variável não tem sentido desde que a função sai e a variável $a desaparece.

source: To make a useful counting function which will not lose track of the current count, the $a variable is declared static:
pt_br: Para faze-la mais útil como contadora sem deixar de perder o sua conta atual, a variável $a é declarada como estática:

source: ?php function Test() {static $a = 0; echo $a; $a++;}?
pt_br: ?php function Teste() {static $a = 0; echo $a; $a++;}?

source: Now, every time the Test() function is called it will print the value of $a and increment it.
pt_br: Agora, cada vez que a função Teste() for chamada ele imprimirá o valor de $a e o incrementará.

source: Static variables also provide one way to deal with recursive functions.
pt_br: Variáveis estáticas fornecem uma solução ideal para funções recursivas.

source: A recursive function is one which calls itself.
pt_br: Uma função recursiva é aquela se chama a si mesma.

source: Care must be taken when writing a recursive function because it is possible to make it recurse indefinitely.
pt_br: Cuidados especiais precisam ser tomados quando escrevendo funções recursivas porque é possível que ela continue na recursão indefinidamente.

source: You must make sure you have an adequate way of terminating the recursion.
pt_br: Você tem de ter certeza que há uma maneira segura de terminar a recursão.

source: The following simple function recursively counts to 10, using the static variable $count to know when to stop:
pt_br: A seguinte função recursiva conta até 10, utilizando a variável estática $count para saber quando parar:

source: ?php function Test() {static $count = 0; $count++; echo $count; if ($count 10) {Test ();} $count--;}?
pt_br: ?php function Teste() {static $count = 0; $count++; echo $count; if ($count 10) {Test ();} $count--;}?

source: The Zend Engine 1, driving PHP4, implements the static and global modifier for variables in terms of references.
pt_br: O Zend Engine 1, base do PHP4, implementa os modificadores static e global para variáveis em termos de referência.

source: For example, a true global variable imported inside a function scope with the global statement actually creates a reference to the global variable.
pt_br: Por exemplo, uma variável global importada dentro do escopo de uma função com a instrução global atualmente cria uma referência para a variável global.

source: This can lead to unexpected behaviour which the following example addresses:
pt_br: Isto pode causar comportamentos impresíveis para os seguintes casos:

source: Executing this example will result in the following output:
pt_br: Executando esse exemplo você terá as seguites saídas:

source: A similar behaviour applies to the static statement.
pt_br: Uma situação similar se aplica ao modificador static.

source: References are not stored statically:
pt_br: Referências não são armazenadas estaticamente:

source: ?php function get_instance_ref() {static $obj; echo "Static object: "; var_dump($obj); if (!isset($obj)) {/ / Assign a reference to the static variable $obj = new stdclass;} $obj - property++; return $obj;} function get_instance_noref() {static $obj; echo "Static object:"; var_dump($obj); if (!isset($obj)) {/ / Assign the object to the static variable $obj = new stdclass;} $obj - property++; return $obj;} $obj1 = get_instance_ref(); $still_obj1 = get_instance_ref(); echo "\n"; $obj2 = get_instance_noref(); $still_obj2 = get_instance_noref();?
pt_br: ?php function get_instance_ref() {static $obj; echo "Objeto estatico: "; var_dump($obj); if (!isset($obj)) {/ / Assimila uma referencia a variavel estatica $obj = new stdclass;} $obj - property++; return $obj;} function get_instance_noref() {static $obj; echo "Objeto estatico:"; var_dump($obj); if (!isset($obj)) {/ / Assimila o objeto para a veriavel estatica $obj = new stdclass;} $obj - property++; return $obj;} $obj1 = get_instance_ref(); $still_obj1 = get_instance_ref(); echo "\n"; $obj2 = get_instance_noref(); $still_obj2 = get_instance_noref();?

source: Static object:
pt_br: Objeto estatico:

source: NULL Static object:
pt_br: NULL Objeto estatico:

source: NULL Static object: object( stdClass)(1) {["property"]= int(1)}
pt_br: NULL Objeto estatico: object( stdClass)(1) {["property"]= int(1)}

source: This example demonstrates that when assigning a reference to a static variable, it' s not remembered when you call the get_instance_ref() function a second time.
pt_br: Este exemplo demonstra que quando assimilando uma referência para uma variável estática, ela não se lembra quando você chama a função get_instance_ref() uma segunda vez.

source: Sometimes it is convenient to be able to have variable variable names.
pt_br: As vezes é conveniente poder trabalhar com variáveis variáveis.

source: That is, a variable name which can be set and used dynamically.
pt_br: Isto é, nomes de variáveis que pode ser criadas e utilizadas dinamicamente.

source: A normal variable is set with a statement such as:
pt_br: Uma variável normal é criada numa instrução como:

source: A variable variable takes the value of a variable and treats that as the name of a variable.
pt_br: Uma variável variável pega o valor de uma variável e a trata como o nome de uma variável.

source: In the above example, hello, can be used as the name of a variable by using two dollar signs. i.e.
pt_br: No exemplo acima, hello pode ser utilizada como o nome de uma variável utilizando dois sinais de cifrão:

source: At this point two variables have been defined and stored in the PHP symbol tree: $a with contents "hello" and $hello with contents "world ".
pt_br: Neste ponto, duas variáveis foram definidas e preservadas na árvore de símbolos do PHP: $a contendo "hello" e $hello contendo "world ".

source: Therefore, this statement:
pt_br: Da mesma forma, esta instrução:

source: produces the exact same output as:
pt_br: produz a mesma saida que:

source: i.e. they both produce: hello world.
pt_br: no caso: hello world.

source: In order to use variable variables with arrays, you have to resolve an ambiguity problem.
pt_br: Para poder utilizar variáveis variáveis com arrays, você precisa resolver um problema de ambigüidade.

source: That is, if you write $$a[ 1] then the parser needs to know if you meant to use $a[1] as a variable, or if you wanted $$a as the variable and then the [1] index from that variable.
pt_br: Assim, se você escrever $$a[ 1] então o interpretador pode entender que você quer usar $a[1] como uma variável ou que você quer usar $$a como uma variável e [1] como o índice dessa variável.

source: The syntax for resolving this ambiguity is: ${$a[1]} for the first case and ${$a}[1] for the second.
pt_br: A sintaxe para resolver essa ambigüidade é ${$a[1]} para o primeiro caso e ${$a}[1] para o segundo.

source: Please note that variable variables cannot be used with PHP 's Superglobal arrays.
pt_br: Verifique que variáveis variáveis não podem ser utilizadas com os novos arrays superglobais.

source: This means you cannot do things like ${$_GET}.
pt_br: Isto significa que você não pode fazer coisas como ${$_GET}.

source: If you are looking for a way to handle availability of superglobals and the old HTTP_*_VARS, you might want to try referencing them.
pt_br: Se você está procurando uma maneira de manipular as superglobais como as antigas HTTP_*_VARS, você deve tentar referenciá-las.

source: Appendix B.
pt_br: Apêndice B.

source: Migrating from PHP 3 to PHP 4
pt_br: Próxima

source: With PHP 3 the error reporting level was set as a simple numeric value formed by summing up the numbers related to different error levels.
pt_br: Configuration changes

source: PHP 4 and the integrated Zend engine have greatly improved PHP 's performance and capabilities, but great care has been taken to break as little existing code as possible.
pt_br: Migrating from PHP 3 to PHP 4

source: The Adabas and Solid database extensions are no more.
pt_br: Deprecate functions and extensions

source: unset(), although still available, is implemented as a language construct rather than a function.
pt_br: Changed status for unset()

source: Example B-1.
pt_br: Exemplo B-1.

source: Appendix C.
pt_br: Apêndice C.

source: Migrating from PHP / FI 2 to PHP 3
pt_br: Próxima

source: PHP 3.0 is rewritten from the ground up.
pt_br: Migrating from PHP / FI 2 to PHP 3

source: Example C-5.
pt_br: Exemplo C-5.

source: Example C-6.
pt_br: Exemplo C-6.

source: Example C-11.
pt_br: Exemplo C-11.

source: Example C-1.
pt_br: Exemplo C-1.

source: Example C-2.
pt_br: Exemplo C-2.

source: Example C-3.
pt_br: Exemplo C-3.

source: Example C-4.
pt_br: Exemplo C-4.

source: Example C-9.
pt_br: Exemplo C-9.

source: Example C-10.
pt_br: Exemplo C-10.

source: Example C-7.
pt_br: Exemplo C-7.

source: Example C-8.
pt_br: Exemplo C-8.

source: The current possible PCRE modifiers are listed below.
pt_br: Pattern Modifiers

source: The names in parentheses refer to internal PCRE names for these modifiers.
pt_br: Pattern Modifiers - - Describes possible modifiers in regex patterns

source: The PCRE library is a set of functions that implement regular expression pattern matching using the same syntax and semantics as Perl 5, with just a few differences (see below).
pt_br: Pattern Syntax - - Describes PCRE regex syntax

source: The differences described here are with respect to Perl 5.005.
pt_br: Differences From Perl

source: If PCRE_UNGREEDY is set, the greediness of the repeti - tion quantifiers is inverted, that is, by default they are not greedy, but if followed by a question mark they are.
pt_br: Regular Expression Details

source: As a trivial example, the pattern The quick brown fox matches a portion of a subject string that is identical to itself.
pt_br: Meta-characters

source: All non-alphanumeric characters other than\, -, ^ (at the start) and the terminating] are non-special in character classes, but it does no harm if they are escaped.
pt_br: Vertical bar

source: If the PCRE_EXTENDED option is set, an unescaped # character outside a character class introduces a comment that contin - ues up to the next newline character in the pattern.
pt_br: Recursive patterns

source: If no memory can be obtained, it saves data for the first 15 capturing parentheses only, as there is no way to give an out-of-memory error from within a recursion.
pt_br: Performances

source: The error levels are:
pt_br: E_NOTICE

source: For example, trying to access the value of a variable which has not been set, or calling stat() on a file that doesn't exist.
pt_br: E_WARNING

source: These indicate errors that can not be recovered from, such as a memory allocation problem.
pt_br: E_PARSE

source: All of the above.
pt_br: E_ALL
